examples/Lousiana_8am_stl/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    "(north|south|west|east)"
    {
       // type            fixedFluxPressure;
      //  value           $internalField;   
        type            zeroGradient;
    }

    "(top)"
    {
      type            fixedFluxPressure;
      value           uniform 0;

     // type            zeroGradient;
    }

    "(bottom|terrain)"
    {      
     // type            zeroGradient;
      type            fixedFluxPressure;
      value           uniform 0;
    }

    tank1
    {
      //  type            zeroGradient;
        type            fixedFluxPressure;
        value           uniform 0;
    }


    default
    {
       // type            fixedFluxPressure;
       // value           $internalField;
        type            zeroGradient;
    }    
}


// ************************************************************************* //
