examples/Lousiana_8am_stl/0.orig/CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(north|south|east|west)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    "(terrain|bottom)"
    {
        type            zeroGradient;
    }

    tank1
    {
//	    type            fixedValue;
//        value           uniform 0.1821;
      type            zeroGradient;
    }


    default
    {
        type            zeroGradient;
    }
  
}


// ************************************************************************* //
