examples/Lousiana_8am_stl/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tatm 300;               // 25 degrees
Tground 309.787196;     // ground is hotter  DATA

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tatm;

boundaryField
{
    
    top
    {
       // type            fixedValue;
       // value           uniform $Tatm;
        type           zeroGradient;
    }

    "(bottom|terrain)"
    {
      //  type           zeroGradient;
       type            fixedValue;
       value           uniform $Tground;
    }

   "(north|south)"
    {
        type            zeroGradient;
    }

    "(east|west)"
    {
        type            zeroGradient;
    }


    default
    {
        type            zeroGradient;
    }

    tank1
    {
 //      type            fixedValue;
 //      value           uniform 1520;
       type            zeroGradient; 
    }
	    


}


// ************************************************************************* //
