examples/Lousiana_8am_stl/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(north|south)"
    {
        type            zeroGradient;        
    }


    "(east|west)"
    {
        type            zeroGradient;
    }


    top
    {
        type            zeroGradient;
    }

    "(bottom|terrain)"
    {
      //  type            nutkAtmRoughWallFunction; 
     //   value           uniform 0.0;
     //   z0              uniform 0.5;
        type           zeroGradient;      
    }

    default
    {
        type            zeroGradient;
    }

    tank1
    {
        type            zeroGradient;
    }


  
}


// ************************************************************************* //
