examples/Lousiana_8am_stl/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.tank;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    tank1;
        type    faceSet;
        action  new;
     //   source  cylinderToCell;
     //   p1 (5343.0 2700.0 -5);
  	 //   p2 (5343.0 2700 20);
 	 //   radius 100;
        source  boxToFace;
        box (5300.0 2650.0 -5) (5400.0 2750 20);
    }
);

// ************************************************************************* //
//  5343.3 2700.7 //
