examples/Lousiana_8am_stl/system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c2;
        type    cellSet;
        action  new;
      //  source  boxToCell;
     //   box (5200.0 2600.0 0.001) (5600.0 2800 500);
        source  cylinderToCell;
        p1 (5343.3 2700.7 -1);
        p2 (5343.3 2700.7 500);
        radius 200;
    }
);

// ************************************************************************* //
//  5343.3 2700.7 //
