examples/Lousiana_8am_stl/system/topoSetDict.3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c3;
        type    cellSet;
        action  new;
       // source  boxToCell;
       // box (5300.0 2650.0 0.001) (5400.0 2750 200);
        source  cylinderToCell;
        p1 (5343.3 2700.7 -1);
        p2 (5343.3 2700.7 200);
        radius 100;
    }
);

// ************************************************************************* //
//  5343.3 2700.7 //
