examples/Lousiana_8am_stl/system/topoSetDict.tank
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.tank;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    tank1;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        p1 (5343.3 2700.7 16);
        p2 (5343.3 2700.7 18);
        radius 36;
    }
);

// ************************************************************************* //
//  5343.3 2700.7  TO USE WITH STL TERRAIN//
